proposal_Anouk.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-16 Mon 11:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Using Nbgrader</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jan" />
</head>
<body>
<div id="content">
<h1 class="title">Using Nbgrader</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1f4c286">1. create a number of notebooks with nbgrader</a></li>
<li><a href="#org7dac573">2. create notebooks with answers and automatic grading</a></li>
<li><a href="#orge463418">3. create the directory infrastructure</a></li>
<li><a href="#org102a15e">4. automate getting the students' notebooks from github</a></li>
<li><a href="#org9beb664">5. automate giving students feedback</a></li>
</ul>
</div>
</div>
<p>
This note describes how I would like to use <a href="https://github.com/jupyter/nbgrader">nbgrader</a> for courses. This requires a number of steps that Anouk can work on. I am not sure how long this will take. My suggestion is to simply start and see how quickly we move through the steps below.
</p>

<p>
To get an idea of nbgrader, watch this video from SciPy 2017:
</p>

<p>
<iframe width="440" height="335" src="https://www.youtube.com/embed/5WUm0QuJdFw" frameborder="0" allowfullscreen></iframe>
</p>

<p>
To get this working for us, I suggest the following steps.
</p>

<div id="outline-container-org1f4c286" class="outline-2">
<h2 id="org1f4c286"><span class="section-number-2">1</span> create a number of notebooks with nbgrader</h2>
<div class="outline-text-2" id="text-1">
<p>
This step actually serves two purposes:
</p>
<ul class="org-ul">
<li>makes us familiar with nbgrader;</li>
<li>the notebooks for the Bsc course need to be made more interactive so that students can practice in class.</li>
</ul>

<p>
My proposal is to add some questions (as with "Exercise" in the Msc course Applied Economics), that are simple enough that students can make them directly in class to practice python.
</p>

<p>
Some of the Comp. Policy notebooks already have exercises, but most of them are more like homework exercises as they are not solved within a minute or two in class. So, here, we would like to add simple coding exercises which students can solve by typing one or two lines of code or by copy-paste and making small adjustments.
</p>

<p>
Notebooks that we can make more interactive:
</p>
<ul class="org-ul">
<li>price discrimination: <a href="http://janboone.github.io/competition_policy_and_regulation/Article102Part2.html">http://janboone.github.io/competition_policy_and_regulation/Article102Part2.html</a></li>
<li>mergers: <a href="http://janboone.github.io/competition_policy_and_regulation/Mergers/Mergers.html">http://janboone.github.io/competition_policy_and_regulation/Mergers/Mergers.html</a></li>
<li>innovation: <a href="http://janboone.github.io/competition_policy_and_regulation/Innovation/Innovation.html">http://janboone.github.io/competition_policy_and_regulation/Innovation/Innovation.html</a></li>
<li>health care: <a href="http://janboone.github.io/competition_policy_and_regulation/Healthcare/Healthcare.html">http://janboone.github.io/competition_policy_and_regulation/Healthcare/Healthcare.html</a></li>
</ul>

<p>
Adding three or four such coding exercises per notebook will be fine.
</p>

<p>
Also add the answer to each of these questions so we can test the export to students (without answers) and the version for teachers (with answers). But these answers do not need to be "gradeable".
</p>
</div>
</div>

<div id="outline-container-org7dac573" class="outline-2">
<h2 id="org7dac573"><span class="section-number-2">2</span> create notebooks with answers and automatic grading</h2>
<div class="outline-text-2" id="text-2">
<p>
For this step we can use notebooks for the 1st year Bsc course "Programming for Economists". Note that these notebooks are "confidential"; students need to make these and they will be graded by us. This year we will grade by hand, but in the future we may want to try automatic grading for these. Hence, the notebook should be set up so that automatic grading is possible (for some of the questions).
</p>
</div>
</div>

<div id="outline-container-orge463418" class="outline-2">
<h2 id="orge463418"><span class="section-number-2">3</span> create the directory infrastructure</h2>
<div class="outline-text-2" id="text-3">
<p>
nbgrader requires a specific directory structure to grade the students files. What is this directory structure exactly and what are the requirements? E.g. exact naming of the notebook files; should directory name be linked to student name/id etc.
</p>
</div>
</div>

<div id="outline-container-org102a15e" class="outline-2">
<h2 id="org102a15e"><span class="section-number-2">4</span> automate getting the students' notebooks from github</h2>
<div class="outline-text-2" id="text-4">
<p>
Once we know the directory structure, we can automate cloning/pulling students' github directories. Idea here is to write a python script that will create the correct directory structure and pull all notebooks file in these directories. We have a google form with students' names on github. We ask students to have a directory "programming_assignments" and then clone/pull the directory "github.com/&lt;student github name&gt;/programming_assignments" for each student.
</p>

<p>
Then we run nbgrader to grade all the notebooks we pulled in.
</p>
</div>
</div>

<div id="outline-container-org9beb664" class="outline-2">
<h2 id="org9beb664"><span class="section-number-2">5</span> automate giving students feedback</h2>
<div class="outline-text-2" id="text-5">
<p>
Suppose we type in students' notebooks some feedback for the students. Then we want students to read this feedback. One way to do this is via "git request-pull", see for instance, <a href="https://www.git-scm.com/docs/git-request-pull">here</a>. Again we need a python script to automate this.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jan</p>
<p class="date">Created: 2017-10-16 Mon 11:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
